Revit 2027 API
BuiltInFailures.FabricFailures.FabricAreaWrongLapSplice Property
 Fabric Area Sheet lap splice is incorrect. Can't create Fabric Area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricAreaWrongLapSplice { get; }
Public Shared ReadOnly Property FabricAreaWrongLapSplice As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricAreaWrongLapSplice {
	FailureDefinitionId^ get ();
}
static member FabricAreaWrongLapSplice : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace